package git_basic;

public class Git_Basic {

	public static void main(String[] args) {
		System.out.println("git");
//      - git
//		
//		형상관리시스템 version control system 의 한 종류 개발자들이 관련된 파일들을 저장하는 데 사용
//		게임의 세이브 포인트와 유사, 저장시점으로 돌아갈 수 있다.
//
//		- commit 
//		언제든지 커밋한 시점으로 돌아갈 수 있다. 저장을 원하는 파일을 묶어서 커밋 명령 수행
//
//		- 스테이지에 올린다 (add)
//		 
//		앞에서 커밋하기 전에 저장을 원하는 파일들을 묶는 일을 해야한다. 
//		스테이지에 파일을 올린다라고 한다. 
//
//		- github에 업로드(push)
//		 커밋을 하면 이제 현재 작업 내용의 세이브 데이터가 내 컴퓨터에 저장됩니다. 
//		github에 업로드 하면 공유도 가능 + 다시 복구 가능
//		-> git push
//
//		커밋 주의 사항 
//
//		반드시 한번에 하나의 논리적 작업만을 커밋 
//		꼼꼼히 적기
//		첫줄에 간단 명확내용
//
//		소스 코드 
//
//		코드뭉치 버리기 하면 직전 상태로 이동 checkout과 같은 개념
//
//		브랜치(기능개발을 할 때 씀)
//
//		브랜치란 : 기존내용을 유지한채 새로운 내용을 추가하고 싶을때 사용
//		체크아웃 : 특정 브랜치로 돌아가고 싶을때 사용
//		소스트리의 체크아웃 : 브랜치이름을 더블클릭
//
//
//		- merge
//
//		브랜치 두개를 합치는 것.
//		현재브랜치 = headBranch
//
//		충돌이 날 가능성도 있다. 
//
//
//		헤드브랜치에 변경사항이 없고 병합대상이 없고
//		병합대상 브랜치가 헤드로부터 시작된 경우 
//		매우쉽게 병합 가능
//		 
//
//		헤드브랜치에 추가적인 커밋이 생기는 경우
//		진짜 병합이 필요해진다. 
//		충돌이 나도 겁내지 말자. 
//		수정해주면 됨.
		
	}

}
